Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
bool shouldRun(Device* lamp) {
    uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
    uint16_t minutesOn = lamp->getHourOn() * 60 + lamp->getMinuteOn();
    uint16_t minutesOff = lamp->getHourOff() * 60 + lamp->getMinuteOff();
    bool result;
    if ((minutes > minutesOn) && (minutes < minutesOff)) {
        result = true;
    } else {
        result = false;
    }
    return result;
}

void delPtr(const char* p) {
    delete[] p;
}

char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void sendMessage(const String& message) {
    char* url = nullptr;
    char* ct = nullptr;
    char* att = nullptr;
    char* actitle = nullptr;
    char* actext = nullptr;
    char* aj = nullptr;
    url = getPGMString(urlPushMessage);
    aj = getPGMString(applicationJson);
    ct = getPGMString(contentType);
    att = getPGMString(androidTickerText);
    actitle = getPGMString(androidContentTitle);
    actext = getPGMString(androidContentText);
    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + message + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
}

void sendMessage(Device* device, bool state) {
    char dataMsg[100];
    String stateString = state ? "Включение" : "Выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "Прожектор %s в %s", device->getName().c_str(), String(p).c_str());
    delPtr(p);

    char* url = nullptr;
    char* ct = nullptr;
    char* att = nullptr;
    char* actitle = nullptr;
    char* actext = nullptr;
    char* aj = nullptr;
    url = getPGMString(urlPushMessage);
    aj = getPGMString(applicationJson);
    ct = getPGMString(contentType);
    att = getPGMString(androidTickerText);
    actitle = getPGMString(androidContentTitle);
    actext = getPGMString(androidContentText);

    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + stateString + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), String(dataMsg));
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("  Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
    stateString.clear();
}

AlarmID_t findAlarmByDevice(Device* device, bool isOn) {
    AlarmID_t result = -1;
    for (auto scheduleItem : schedulesArray) {
        auto deviceToFind = scheduleItem.getDevice();
        if (device == deviceToFind) {
            result = isOn ? scheduleItem.getOn() : scheduleItem.getOff();
            break;
        }
    }
    return result;
}

void deviceOnHandler(Device* device) {
    if (device->getEnabled()) {
        if (device->getType() == Device::Compressor) {
            Serial.printf_P(PSTR("  Включение компрессора. PIN %d\n"), device->getPin());
        } else if (device->getType() == Device::Light) {
            Serial.printf_P(PSTR("  Включение прожектора %s. PIN %d\n"), device->getName().c_str(), device->getPin());
        } else if (device->getType() == Device::Doser) {
            Serial.printf_P(PSTR("  Включение дозатора %s. PIN %d\n"), device->getName().c_str(), device->getPin());
        }
        shiftRegister.setPin(countShiftRegister, device->getPin(), HIGH);

        sendMessage(device, true);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setState(true);

        vectorDevices.push_back(device);
    } else {
        if (device->getType() == Device::Compressor) {
            Serial.printf_P(PSTR("  %s\n"), "Компрессор нельзя изменять.");
        } else if (device->getType() == Device::Light) {
            Serial.printf_P(PSTR("  Прожектор %s нельзя изменять.\n"), device->getName().c_str());
        } else if (device->getType() == Device::Doser) {
            Serial.printf_P(PSTR("  Дозатор %s нельзя изменять.\n"), device->getName().c_str());
        }
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void deviceOffHandler(Device* device) {
    if (device->getEnabled()) {
        if (device->getType() == Device::Compressor) {
            Serial.printf_P(PSTR("  Выключение компрессора. PIN %d\n"), device->getPin());
        } else if (device->getType() == Device::Light) {
            Serial.printf_P(PSTR("  Выключение прожектора %s. PIN %d\n"), device->getName().c_str(), device->getPin());
        } else if (device->getType() == Device::Doser) {
            Serial.printf_P(PSTR("  Выключение дозатора %s. PIN %d\n"), device->getName().c_str(), device->getPin());
        }
        shiftRegister.setPin(countShiftRegister, device->getPin(), LOW);
        sendMessage(device, false);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setState(false);
        vectorDevices.push_back(device);
    } else {
        if (device->getType() == Device::Compressor) {
            Serial.printf_P(PSTR("  %s\n"), "Компрессор нельзя изменять.");
        } else if (device->getType() == Device::Light) {
            Serial.printf_P(PSTR("  Прожектор %s нельзя изменять.\n"), device->getName().c_str());
        } else if (device->getType() == Device::Doser) {
            Serial.printf_P(PSTR("  Дозатор %s нельзя изменять.\n"), device->getName().c_str());
        }
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void doserHandler(const doser& dos) {
    String message;
    message = "Включение дозатора " + dos.name;
    sendMessage(message);
    message.clear();

    switch (dos.type) {
        case K:
            doserK->begin();
            doserK->setEnableActiveState(LOW);
            doserK->move(dos.steps);
            doserK->setEnableActiveState(HIGH);
            break;
        case NP:
            doserNP->begin();
            doserNP->setEnableActiveState(LOW);
            doserNP->move(dos.steps);
            doserNP->setEnableActiveState(HIGH);
            break;
        case Fe:
            doserFe->begin();
            doserFe->setEnableActiveState(LOW);
            doserFe->move(dos.steps);
            doserFe->setEnableActiveState(HIGH);
            break;
        default:
            break;
    }
}

