Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void getParamsBackEnd() {
    Serial.printf_P(PSTR("%s\n"), "Чтение параметров из облака");
    getParamLights();
    getParamDosers();
    getParamCompressor();

    setParamsEEPROM();
}

void setInternalClock() {
    configTime(MYTZ, ntpServerName);
    time_t now = time(nullptr);
    uint8_t tryCount = 0;
    while (now < 8 * 3600 * 2) {
        delay(100);
        now = time(nullptr);
        tryCount++;
        if (tryCount > 50) {
            break;
        }
    }
    struct tm timeinfo {};
    gmtime_r(&now, &timeinfo);
    Serial.printf_P(PSTR("Time установлено в %d\n"), now);
}

void initRealTimeClock() {
    clockRTC.begin();
    char* df = clockRTC.dateFormat("H:i:s Y-m-d", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Время: %s\n"), String(df).c_str());
    free(df);
}

void sendNTPpacket(const IPAddress& address) {
    memset(packetBuffer, 0, NTP_PACKET_SIZE);
    packetBuffer[0] = 0b11100011;
    packetBuffer[1] = 0;
    packetBuffer[2] = 6;
    packetBuffer[3] = 0xEC;
    packetBuffer[12] = 49;
    packetBuffer[13] = 0x4E;
    packetBuffer[14] = 49;
    packetBuffer[15] = 52;

    udp.beginPacket(address, 123);
    udp.write(packetBuffer, NTP_PACKET_SIZE);
    udp.endPacket();
}

void syncTime() {
    Serial.printf_P(PSTR("Синхронизация времени с %s\n"), ntpServerName);
    udp.begin(2390);
    WiFi.hostByName(ntpServerName, timeServerIP);
    sendNTPpacket(timeServerIP);
    delay(1000);
    int cb = udp.parsePacket();
    if (!cb) {
        Serial.printf_P(PSTR(" Нет ответа от сервера времени %s\n"), ntpServerName);
        count_sync++;
    } else {
        count_sync = 0;
        Serial.printf_P(PSTR(" Получен ответ от сервера времени %s\n"), ntpServerName);
        udp.read(packetBuffer, NTP_PACKET_SIZE);
        unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
        unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
        unsigned long secsSince1900 = highWord << 16 | lowWord;
        const unsigned long seventyYears = 2208988800UL;
        unsigned long epoch = secsSince1900 - seventyYears;
        // 2 секунды разница с большим братом
        epoch = epoch + 2 + 10800;

        char str[20];
        rtc.dateTimeToStr(str);
        Serial.printf_P(PSTR(" %s\n"), str);
        uint32_t rtcEpoch = rtc.getEpoch();
        Serial.printf_P(PSTR(" RTC: %lu\n"), rtcEpoch);
        Serial.printf_P(PSTR(" NTP: %lu\n"), epoch);

        if ((rtcEpoch - epoch) > 2) {
            Serial.printf_P(PSTR(" %s"), "Обновляем RTC (разница между эпохами = ");
            if ((rtcEpoch - epoch) > 10000) {
                Serial.printf_P(PSTR(" %s\n"), (epoch - rtcEpoch));
            } else {
                Serial.printf_P(PSTR(" %s\n"), (rtcEpoch - epoch));
            }
            rtc.setEpoch(epoch);
        } else {
            Serial.printf_P(PSTR(" %s\n"), "Дата и время RTC не требуют синхронизации");
        }
    }
}

void initHTTPClient() {
#ifdef ARDUINO_ARCH_ESP8266
    client->setInsecure();
    bool mfl = client->probeMaxFragmentLength("api.backendless.com", 443, 1024);
    if (mfl) {
        client->setBufferSizes(1024, 1024);
    }
#endif
}

void initDevices() {
    devicesArray.at(0).setName("One");
    devicesArray.at(1).setName("Two");
    devicesArray.at(2).setName("Three");
    devicesArray.at(3).setName("Four");
    devicesArray.at(4).setName("Five");
    devicesArray.at(5).setName("Six");
    devicesArray.at(6).setName("Compressor");
    devicesArray.at(6).setType(Device::Compressor);

    for (size_t i = 0; i < devicesArray.size(); ++i) {
        schedulesArray.at(i).setDevice(&(devicesArray.at(i)));
        Serial.println(devicesArray.at(i).getName().c_str());
    }
}

void initDosersArray() {
    dosersArray[0].name = "K";
    dosersArray[0].type = K;
    dosersArray[1].name = "NP";
    dosersArray[1].type = NP;
    dosersArray[2].name = "Fe";
    dosersArray[2].type = Fe;
}

void setCurrentState(Device* device) {
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    if (device->getType() == Device::Compressor) {
        url = getPGMString(urlPutCompressor);
        urlString = String(url);
    } else if (device->getType() == Device::Light) {
        url = getPGMString(urlPutLight);
        urlString = String(url) + String(device->getObjectId().c_str());
    } else if (device->getType() == Device::Doser) {
        // TODO use doser url
        // url = getPGMString(urlPutLight);
        // urlString = String(url) + led.led.objectId;
    }

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    // TODO make Serialize based on Device::Type. Now Lights only
    payload = String(device->serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("Состояние прожектора %s установлено в %s\n"), device->getName().c_str(),
                            (device->getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("setCurrentState() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "setCurrentState() -> Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void putUptime(const String& uptime) {
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    url = getPGMString(urlPutUptime);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = R"({"uptime":")" + uptime + "\"}";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putUptime() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putUptime() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

